Highlighted lines overlap. Lines may not form closed loops.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CurvesOverlap { get; }
  Visual Basic
Public Shared ReadOnly Property CurvesOverlap As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CurvesOverlap {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures OverlapFailures Class
  Autodesk.Revit.DB Namespace